{
    "ClassName": "Citrus Limon (Lemon) ",
    "imageName": "Citrus Limon (Lemon).jpg",
    "ScientificName": "Citrus Limon",
    "Location": [" Maharashtra", "Andhra Pradesh", "West Bengal", "Orissa"," Assam"],
    "Information": "Lemon leaves are rich in vitamins and minerals that are beneficial for the skin,rich in antioxidants,Antimicrobial Effects,Detoxification,helps stimulate the production of digestive enzymes, promoting better digestion and has Anti-inflammatory Properties." 
,"Procedure":"Skincare:Create a herbal infusion by steeping fresh or dried lemon leaves in hot water.Use the infused water as a facial toner or astringent to help tighten pores and refresh the skin.\n\nThe vitamins and minerals present in lemon leaves may help nourish the skin and promote a healthy complexion.\n\nAntioxidant Effects:Consume lemon leaf tea regularly to benefit from its antioxidant properties, which can help combat free radicals and oxidative stress in the body.\n\nAntioxidants present in lemon leaves may contribute to overall health and well-being by supporting cellular health and reducing the risk of chronic diseases.\n\nAntimicrobial Effects:Prepare a concentrated decoction or extract of lemon leaves by boiling them in water.Use the cooled decoction as a natural mouthwash or gargle to help kill bacteria in the mouth and throat.\n\nThe antimicrobial properties of lemon leaves may help promote oral health and prevent infections.\n\nDetoxification:Drink lemon leaf tea regularly as part of a detoxification regimen to help cleanse the body of toxins and impurities.\n\nThe detoxifying properties of lemon leaves may support liver function and promote overall detoxification processes in the body.\n\nDigestive Support:Chew on fresh lemon leaves or add them to dishes as a flavoring agent to stimulate the production of digestive enzymes.\n\nDrinking lemon leaf tea after meals may help promote better digestion and alleviate symptoms of indigestion or bloating.\n\nLemon leaves are believed to aid in the breakdown of food and the absorption of nutrients, leading to improved digestion and overall gut health.\n\nAnti-inflammatory Properties:Apply a poultice made from crushed lemon leaves directly to inflamed or irritated skin.\n\nThe anti-inflammatory properties of lemon leaves may help reduce redness, swelling, and discomfort associated with various skin conditions or injuries."
}
