
{
    "ClassName": "Citron lime (herelikai)",
    "imageName": "Citron lime (herelikai).jpg",
    "ScientificName": "Herelikai",
    "Location": [" Maharashtra", "Bihar", "West Bengal", "Andhra Pradesh", "Telangana"," Gujarat", "Goa", "Punjab","Haryana."],
    "Information": "The citron is a known immunity booster, and a panacea for all gut troubles. Its slightly bitter taste is a wonderful palate cleanser, and is known as 'pitta-ahara' in Ayurvedic texts, the remedy for 'pitha dosha' characterised by conditions of nausea, acidity and indigestion."
,"Procedure":"Internal Consumption:Citron lime juice can be extracted by squeezing fresh citron limes.\n\nDrink the freshly squeezed citron lime juice regularly to boost immunity and support digestive health.\n\nThe slightly bitter taste of citron lime acts as a palate cleanser and helps balance 'pitta dosha,' which is associated with conditions like nausea, acidity, and indigestion.\n\nIncorporation into Diet:Add freshly squeezed citron lime juice to water or herbal teas for a refreshing and immune-boosting beverage.\n\nUse citron lime juice as a salad dressing or as a flavoring agent in various dishes to enjoy its health benefits while enhancing the taste of your meals.\n\nAyurvedic Remedies:Prepare a concoction by mixing citron lime juice with honey and ginger to soothe digestive discomforts such as acidity and indigestion.\n\nConsume this concoction regularly, especially after meals, to aid digestion and alleviate symptoms of 'pitta dosha.'\n\nPalate Cleanser:Sip on diluted citron lime juice between meals to cleanse the palate and refresh the taste buds.This practice not only promotes digestive health but also helps maintain oral hygiene and overall well-being.\n\nWhile citron lime is generally safe for consumption, excessive intake may lead to acidity or other digestive issues in some individuals.\n\nHolistic Approach:In Ayurveda, citron lime is considered part of a holistic approach to health and wellness. Its immune-boosting and digestive properties make it a valuable addition to a balanced lifestyle aimed at promoting overall well-being."
 }
