
{
    "ClassName": "Crown-flower",
    "imageName": "Crown-flower.jpg",
    "ScientificName": "Calotropis gigantea",
    "Location": [" Kanchanaburi", "Kerala", "costal areas"],
    "Information": "The plant is reported as effective in treating skin, digestive, respiratory, circulatory and neurological disorders and was used to treat fevers, elephantiasis, nausea, vomiting, and diarrhea. The milky juice of Calotropis procera was used against arthritis, cancer, and as an antidote for snake bite.",
    "Procedure":"Skin Disorders:Crush fresh crown-flower leaves to extract their juice.\n\nApply the juice topically to the affected area to treat skin disorders such as rashes, irritations, and infections.\n\nThe antimicrobial and anti-inflammatory properties of crown-flower leaves may help alleviate symptoms and promote healing of skin conditions.\n\nDigestive Disorders:Prepare a decoction by boiling crown-flower leaves in water.\n\nDrink the cooled decoction to relieve digestive issues such as nausea, vomiting, and diarrhea.\n\nThe decoction may help soothe the digestive tract, reduce inflammation, and alleviate symptoms of gastrointestinal discomfort.\n\nRespiratory Disorders:Inhale the steam from boiled crown-flower leaves to help alleviate respiratory symptoms such as coughs, congestion, and bronchitis.\n\nThe inhalation of steam may help loosen mucus, clear nasal passages, and provide relief from respiratory discomfort.\n\nCirculatory Disorders:Consume crown-flower leaf decoction or extract to support circulatory health and improve blood flow.\n\nThe bioactive compounds present in crown-flower leaves may help regulate blood pressure, reduce inflammation in blood vessels, and support overall cardiovascular function.\n\nNeurological Disorders:Incorporate crown-flower leaves into your diet or consume them as a supplement to support neurological health.\n\nThe neuroprotective properties of crown-flower leaves may help protect against neurological disorders and promote cognitive function.\n\nOther Uses:The milky juice of crown-flower leaves was traditionally used against arthritis, cancer, and as an antidote for snake bites.\n\nWhile the effectiveness of these uses may vary, consulting with a healthcare professional or herbalist is advisable before using crown-flower leaves for these purposes."
 }
