
{
  "ClassName": "Ekka",
  "imageName": "Ekka.jpg",
  "ScientificName": "Calotropis procera",
  "Location": [" Uttar Pradesh, Rajasthan, Gujarat and  Maharashtra"],
  "Information": " Ekka leaves help to remove inflammation of the body, effective in treating skin, digestive, respiratory, circulatory , neurological disorders and tis oli reduce internal as well as external swelling.",
  "Procedure":"Preparation:Harvest fresh Ekka leaves from the plant. Ensure they are clean and free from any signs of damage or disease.\n\nWash the leaves thoroughly under running water to remove any dirt or impurities.\n\nInternal Consumption:Prepare a decoction by boiling Ekka leaves in water.\n\nStrain the decoction and drink it regularly to help reduce inflammation in the body and alleviate symptoms of digestive, respiratory, circulatory, and neurological disorders.\n\nThe bioactive compounds present in Ekka leaves may help soothe inflammation and promote healing.\n\nTopical Application:Crush fresh Ekka leaves to extract their juice or make a paste.\n\nApply the juice or paste directly to the affected area to treat skin disorders or reduce external swelling.\n\nThe anti-inflammatory and antimicrobial properties of Ekka leaves may help alleviate skin conditions and promote wound healing.\n\nRespiratory Support:Inhale the steam from boiled Ekka leaves to help alleviate respiratory symptoms such as coughs, congestion, and bronchitis.\n\nThe inhalation of steam may help loosen mucus, clear nasal passages, and provide relief from respiratory discomfort.\n\nCirculatory Health:Consume Ekka leaf decoction regularly to support circulatory health and improve blood flow.\n\nThe vasodilatory properties of Ekka leaves may help relax blood vessels, reduce inflammation, and promote overall cardiovascular function.\n\nNeurological Support:Incorporate Ekka leaves into your diet or consume them as a supplement to support neurological health.\n\nThe neuroprotective properties of Ekka leaves may help protect against neurological disorders and promote cognitive function."
}
