
{
    "ClassName": "Ficus Religiosa (Peepal Tree)",
    "imageName": "Ficus Religiosa (Peepal Tree).jpg",
    "ScientificName": "Ficus Religiosa",
    "Location": [" Kerala", "Bihar", "Harayana"," Himalayan foothills", "Madhya Pradesh","the Western Ghats."],
    "Information": "The leaf juice of the peepal tree may be helpful for cough, asthma, diarrhoea, ear pain, toothache, haematuria (blood in urine), migraine, scabies, eye troubles, and gastric problems. The stem bark of the peepal tree might help with paralysis, gonorrhoea, bone fractures, diarrhoea, and diabetes." ,
    "Procedure":"Leaf Juice for Various Ailments:Extract juice from fresh peepal leaves by crushing them or blending them with water.\n\nConsume the leaf juice for the following conditions:Cough and asthma: Drink the juice to alleviate respiratory symptoms.Diarrhea: Drink the juice to help alleviate symptoms of diarrhea and promote digestive health.\n\nEar pain: Apply a few drops of the juice directly into the ear canal to relieve pain and inflammation.Toothache: Apply the juice directly to the affected tooth and gums to numb pain and reduce inflammation.\n\nMigraine: Apply the juice to the temples and forehead to relieve headache pain.\n\nScabies: Apply the juice topically to affected areas to help soothe itching and irritation.\n\nEye troubles: Rinse the eyes with diluted peepal leaf juice to alleviate eye discomfort and promote eye health.\n\nGastric problems: Drink the juice to help soothe digestive issues and promote gastrointestinal health.\n\nStem Bark for Various Ailments:Prepare a decoction or extract from the stem bark of the peepal tree. Consume the decoction or extract for the following conditions:\n\nGonorrhea: Consume the decoction or extract to help treat gonorrhea symptoms.\n\nBone fractures: Apply the decoction or extract topically to promote bone healing and reduce pain.\n\nDiarrhea: Consume the decoction or extract to help alleviate symptoms of diarrhea.\n\nDiabetes: Consume the decoction or extract to help regulate blood sugar levels.\n\nPrecautions:Use peepal leaves and stem bark cautiously and in moderation, as excessive consumption may have adverse effects."
}
