{
    "ClassName": "Ficus-Auriculata-(Roxburgh-fig)",
    "imageName": "Ficus-Auriculata-(Roxburgh-fig).jpg",
    "ScientificName": "Ficus-Auriculata",
    "Location": ["Jharkhand"," Himalayan foothills", "Jammu and Kashmir","the Western Ghats."],
    "Information": "Leaves are crushed and the paste is applied on the wounds. They are also used in diarrhea, diabetes, stomach ache, piles ,antioxidant , anticancer agent and dysentery.",
    "Procedure":"Wound Healing:Crush Ficus Auriculata leaves to create a paste.Apply the paste directly onto wounds or cuts\n\n.The antimicrobial and anti-inflammatory properties of Ficus Auriculata leaves may help promote wound healing and prevent infections.\n\nDiarrhea and Dysentery:Prepare a decoction by boiling Ficus Auriculata leaves in water.Drink the cooled decoction to alleviate symptoms of diarrhea and dysentery.The astringent properties of Ficus Auriculata leaves may help reduce intestinal inflammation and provide relief from diarrhea and dysentery.\n\nDiabetes:Consume Ficus Auriculata leaf extract or decoction regularly as part of a diabetes management regimen.\n\nThe bioactive compounds present in Ficus Auriculata leaves may help regulate blood sugar levels and improve insulin sensitivity.\n\nStomach Ache:Drink Ficus Auriculata leaf tea or infusion to soothe stomach ache and digestive discomfort.\n\nThe calming and anti-inflammatory properties of Ficus Auriculata leaves may help alleviate stomach pain and promote gastrointestinal health.\n\nPiles:Apply a poultice made from crushed Ficus Auriculata leaves directly onto external hemorrhoids.\n\nThe anti-inflammatory and analgesic properties of Ficus Auriculata leaves may help reduce swelling and discomfort associated with piles.\n\nAntioxidant and Anticancer Properties:Consume Ficus Auriculata leaves regularly as part of a balanced diet to benefit from their antioxidant properties.\n\nAntioxidants present in Ficus Auriculata leaves may help neutralize free radicals and reduce the risk of cancer development."
}
