
{
    "ClassName": "Hibiscus",
    "imageName": "Hibiscus.jpg",
    "ScientificName": "Hibiscus rosa-sinensis",
    "Location": [" Maharashtra", "Bihar", "West Bengal", "Uttar Pradesh", "Assam"," Gujarat",".Andhra Pradesh","Tamil Nadu","Karnataka."],
    "Information": "Hibiscus leaves are used for treating loss of appetite, colds, heart and nerve diseases, upper respiratory tract pain and swelling (inflammation), fluid retention, stomach irritation, and disorders of circulation; for dissolving phlegm; as a gentle laxative; and as a diuretic to increase urine output.",
    "Procedure":"Loss of Appetite:Prepare a decoction by boiling hibiscus leaves in water.Drink the decoction before meals to stimulate appetite and promote digestion.\n\nColds and Upper Respiratory Tract Inflammation:Inhale the steam from boiled hibiscus leaves to help relieve congestion and soothe upper respiratory tract inflammation.You can also drink hibiscus tea to benefit from its anti-inflammatory properties.\n\nHeart and Nerve Diseases:Consume hibiscus tea regularly as part of a heart-healthy diet.The antioxidants present in hibiscus leaves may help protect the heart and support nervous system health.\n\nFluid Retention and Diuretic Effects:Drink hibiscus tea regularly to help reduce fluid retention and promote urine output.The diuretic properties of hibiscus leaves may help flush out excess fluid from the body and support kidney function.\n\nStomach Irritation and Digestive Disorders:Drink hibiscus tea to soothe stomach irritation and promote digestive health.The mucilaginous properties of hibiscus leaves may help coat the stomach lining and reduce inflammation.\n\nCirculation Disorders:Consume hibiscus tea regularly to help improve circulation and blood flow.The vasodilatory properties of hibiscus leaves may help relax blood vessels and reduce blood pressure.\n\nPhlegm Dissolution and Gentle Laxative:Drink hibiscus tea to help dissolve phlegm and alleviate respiratory congestion.\n\nThe mucilaginous properties of hibiscus leaves may help loosen phlegm and promote its expulsion from the respiratory tract.Hibiscus tea may also act as a gentle laxative to promote bowel movements and alleviate constipation."
}
