
{
    "ClassName": "Mangifera-Indica-(Mango)",
    "imageName": "Mangifera-Indica-(Mango).jpg",
    "ScientificName": "Mangifera-Indica",
    "Location": [" Maharashtra", " Gujarat", "Madhya Pradesh", "Andhra Pradesh","Karnataka"],
    "Information": "It helps breakdown the kidney stones and throw them out of your body through urination. The leaves are the best form for removing harmful toxins from the body.It manages diabetes, blood pressure,skin health,Beneficial for hair problems and Reduce inflammation cells",
    "Procedure":"Kidney Stone Management:Decoction: Boil fresh mango leaves in water to make a decoction. Strain the liquid and allow it to cool.Consumption: Drink the decoction regularly to help break down kidney stones and facilitate their elimination through urine.\n\nDetoxification:Tea: Steep fresh or dried mango leaves in hot water to make a tea. Allow it to steep for a few minutes before straining.\n\nConsumption: Drink mango leaf tea regularly to help remove harmful toxins from the body and promote overall detoxification.\n\nDiabetes Management:\nInfusion: Soak fresh mango leaves in water overnight to make an infusion.\n\nConsumption: Drink the infused water on an empty stomach in the morning to help regulate blood sugar levels and manage diabetes.\n\nBlood Pressure Regulation:\nTea: Prepare mango leaf tea as described above.\n\nConsumption: Regular consumption of mango leaf tea may help regulate blood pressure and promote cardiovascular health.\n\nSkin Health:\nTopical Application: Crush fresh mango leaves into a paste and apply it to the skin.\n\nUsage: Mango leaf paste may help alleviate various skin conditions and promote overall skin health due to its antioxidant and anti-inflammatory properties.\n\nHair Health:Hair Rinse: Boil mango leaves in water and allow the mixture to cool.\n\nUsage: Use the cooled mango leaf water as a hair rinse after shampooing to promote hair health and address hair problems.\n\nReducing Inflammation:Consumption: Regular consumption of mango leaf tea or decoction may help reduce inflammation in the body due to its anti-inflammatory properties.\n\nPrecautions:Use mango leaves cautiously and in moderation, as excessive consumption may have adverse effects."
}

